In [3]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [5]:
dframe= DataFrame({'city':['Alma','BrianHead', 'Fox Park'],
                 'altitude':[3158,3500,2762]})

In [6]:
dframe

        city  altitude
0       Alma      3158
1  BrianHead      3500
2   Fox Park      2762

In [7]:
statte_map = { 'Alma':'Colorado','BrianHead':'Utah','Fox Park':'Wyoming'}

In [8]:
statte_map

{'Alma': 'Colorado', 'BrianHead': 'Utah', 'Fox Park': 'Wyoming'}

In [9]:
dframe['state']=dframe['city'].map(statte_map)

In [10]:
dframe

        city  altitude     state
0       Alma      3158  Colorado
1  BrianHead      3500      Utah
2   Fox Park      2762   Wyoming

In [ ]:
#------- Replace---------

In [11]:
ser1= Series([1,2,3,4,1,2,3,4])
ser1

0    1
1    2
2    3
3    4
4    1
5    2
6    3
7    4
dtype: int64

In [12]:
ser1.replace(1,np.nan)

0    NaN
1    2.0
2    3.0
3    4.0
4    NaN
5    2.0
6    3.0
7    4.0
dtype: float64

In [13]:
ser1.replace([1,4],[100,400])

0    100
1      2
2      3
3    400
4    100
5      2
6      3
7    400
dtype: int64

In [14]:
ser1.replace({4:np.nan})

0    1.0
1    2.0
2    3.0
3    NaN
4    1.0
5    2.0
6    3.0
7    NaN
dtype: float64

In [15]:
#-------------------- Rename INdex------

In [18]:
dframe = DataFrame(np.arange(12).reshape(3,4),index=['NY','LA','SF'],
columns=['A','B','C','D'])

In [19]:
dframe.index.map(str.lower)

Index(['ny', 'la', 'sf'], dtype='object')

In [20]:
dframe

    A  B   C   D
NY  0  1   2   3
LA  4  5   6   7
SF  8  9  10  11

In [21]:
dframe.columns.map(str.lower)

Index(['a', 'b', 'c', 'd'], dtype='object')

In [22]:
dframe.index=dframe.index.map(str.lower)

In [23]:
dframe

    A  B   C   D
ny  0  1   2   3
la  4  5   6   7
sf  8  9  10  11

In [24]:
dframe.rename(index=str.title,columns=str.lower)

    a  b   c   d
Ny  0  1   2   3
La  4  5   6   7
Sf  8  9  10  11

In [26]:
dframe.rename(index={'ny':'New York'},columns={'A':'Alpha'})

          Alpha  B   C   D
New York      0  1   2   3
la            4  5   6   7
sf            8  9  10  11

In [27]:
dframe

    A  B   C   D
ny  0  1   2   3
la  4  5   6   7
sf  8  9  10  11

In [28]:
dframe.rename(index={'ny':'New York'}, inplace=True)
dframe

          A  B   C   D
New York  0  1   2   3
la        4  5   6   7
sf        8  9  10  11